In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sqlalchemy import create_engine
from utils import db_connect

In [ ]:
# To avoid data type conversion errors, I had to force every data type in all of our five data sources to text.
# I was able to create a view from them called combined data, which can now be ingested into a dataframe without error
# columns will need to be updated to correct data types for further work.
engine = db_connect()

main_df = pd.read_sql('SELECT * FROM combined_data', con=engine)
main_df.head(1)

Connection successful

,X,Y,OBJECTID,NCESSCH,SURVYEAR,STABR,LEAID,ST_LEAID,LEA_NAME,SCH_NAME,...,HIALF,HI,TRALM,TRALF,TR,WHALM,WHALF,WH,LATCOD,LONCOD
0,-86.2062,34.2602000000001,1,10000500870,2020-2021,AL,100005,AL-101,Albertville City,Albertville Middle School,...,230,469,19,10,29,187,184,371,34.2602,-86.2062

In [7]:
main_df.info()

<class 'pandas.DataFrame'>
RangeIndex: 504838 entries, 0 to 504837
Data columns (total 81 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   X                 504838 non-null  str
 1   Y                 504838 non-null  str
 2   OBJECTID          504838 non-null  str
 3   NCESSCH           504838 non-null  str
 4   SURVYEAR          504838 non-null  str
 5   STABR             504838 non-null  str
 6   LEAID             504838 non-null  str
 7   ST_LEAID          504838 non-null  str
 8   LEA_NAME          504838 non-null  str
 9   SCH_NAME          504838 non-null  str
 10  LSTREET1          504828 non-null  str
 11  LSTREET2          2906 non-null    str
 12  LSTREET3          10 non-null      str
 13  LCITY             504838 non-null  str
 14  LSTATE            504838 non-null  str
 15  LZIP              504838 non-null  str
 16  LZIP4             504838 non-null  str
 17  PHONE             504838 non-null  str
 18  CHARTER_TEXT      504838 non-null  str
 19  MAGNET_TEXT       403448 non-null  str
 20  VIRTUAL           504838 non-null  str
 21  GSLO              504838 non-null  str
 22  GSHI              504838 non-null  str
 23  SCHOOL_LEVEL      504838 non-null  str
 24  TITLEI            302719 non-null  str
 25  STITLEI           403448 non-null  str
 26  STATUS            504838 non-null  str
 27  SCHOOL_TYPE_TEXT  504838 non-null  str
 28  SY_STATUS_TEXT    504838 non-null  str
 29  ULOCALE           504838 non-null  str
 30  NMCNTY            504838 non-null  str
 31  TOTFRL            460760 non-null  str
 32  FRELCH            451815 non-null  str
 33  REDLCH            451800 non-null  str
 34  DIRECTCERT        146398 non-null  str
 35  PK                168038 non-null  str
 36  KG                274880 non-null  str
 37  G01               276823 non-null  str
 38  G02               277098 non-null  str
 39  G03               277029 non-null  str
 40  G04               276034 non-null  str
 41  G05               269901 non-null  str
 42  G06               196450 non-null  str
 43  G07               171857 non-null  str
 44  G08               173061 non-null  str
 45  G09               146699 non-null  str
 46  G10               145879 non-null  str
 47  G11               145864 non-null  str
 48  G12               145440 non-null  str
 49  G13               631 non-null     str
 50  UG                46374 non-null   str
 51  AE                761 non-null     str
 52  TOTFENROL         297406 non-null  str
 53  TOTMENROL         297410 non-null  str
 54  TOTAL             495931 non-null  str
 55  MEMBER            495931 non-null  str
 56  FTE               477277 non-null  str
 57  STUTERATIO        484139 non-null  str
 58  AMALM             386745 non-null  str
 59  AMALF             385679 non-null  str
 60  AM                412649 non-null  str
 61  ASALM             435468 non-null  str
 62  ASALF             435027 non-null  str
 63  AS                450182 non-null  str
 64  BLALM             458824 non-null  str
 65  BLALF             456170 non-null  str
 66  BL                469547 non-null  str
 67  HPALM             353571 non-null  str
 68  HPALF             351767 non-null  str
 69  HP                372372 non-null  str
 70  HIALM             484528 non-null  str
 71  HIALF             483526 non-null  str
 72  HI                488318 non-null  str
 73  TRALM             468296 non-null  str
 74  TRALF             467306 non-null  str
 75  TR                476750 non-null  str
 76  WHALM             486015 non-null  str
 77  WHALF             485072 non-null  str
 78  WH                488233 non-null  str
 79  LATCOD            504838 non-null  str
 80  LONCOD            504838 non-null  str
dtypes: str(81)
memory usage: 312.0 MB